export const personalityClassGroups = [
  {
    type: "ENFJ",
    "name": "外向 直觉 感觉 判断",
    "nameDescription": "外向的感觉与内向的直觉",
    "epithet": "施予者",
    "description": "作为 ENFJ，你的主要生活模式是外向型的，你会根据自己对事物的感觉或它们与你个人价值体系的契合程度来处理事情。你的次要模式是内在的，你主要通过直觉来接受事物。ENFJ 是以人为本的人。他们生活在充满可能性的人际世界中。与其他类型的人相比，他们更具有出色的人际交往能力。他们理解人、关心人，并具有将他人的优点发挥到极致的特殊才能。ENFJ 在生活中的主要兴趣是给予他人爱、支持和美好时光。他们专注于理解、支持和鼓励他人。他们为他人创造条件，并从中获得最大的个人满足感。由于 ENFJ 的人际交往能力非常出众，他们有能力让别人完全按照自己的意愿行事。他们能深入人心，得到他们想要的反应。ENFJ的动机通常是无私的，但那些发展得不够理想的ENFJ也会利用他们的权力来操纵别人。ENFJ 非常注重外在，因此独处对他们来说尤为重要。这对一些 ENFJ 来说可能很难，因为他们倾向于对自己苛刻，独处时会陷入阴暗的想法。因此，ENFJ 可能会避免独处，而让自己的生活充满与他人有关的活动。ENFJ倾向于根据他人的需求来确定自己的生活方向和优先顺序，而可能没有意识到自己的需求。他们倾向于把别人的需求放在自己的需求之上，这是很自然的，但他们需要时刻注意自己的需求，以免在帮助别人的过程中牺牲自己。与其他外向型人格类型相比，ENFJ 在暴露自己方面往往更为保守。虽然他们可能有强烈的信念，但如果表达这些信念会影响到他人，他们很可能会避免表达。因为他们最感兴趣的是成为他人改变的催化剂，所以他们很可能以变色龙的方式，而不是以个人的方式，在自己的层面上与他人互动。ENFJ 有明确的价值观和观点，他们能够清楚简洁地表达出来。只要不是太个人化，他们就会表达这些信念。ENFJ 在很多方面都表现得很开放，但他们更注重对他人的回应和支持。当面临强烈的价值观与满足他人需求之间的冲突时，他们极有可能重视他人的需求。即使周围有很多人，ENFJ 也会感到非常孤独。这种孤独感可能会因为他们不暴露真实自我的倾向而加剧。人们喜欢 ENFJ。与他们相处很有趣，他们真正理解和热爱他人。他们通常非常直率和诚实。通常，ENFJ 会散发出很强的自信心，有很强的能力做很多不同的事情。他们通常聪明、充满潜力、精力充沛、节奏明快。他们通常擅长任何能吸引他们兴趣的事情。ENFJ 喜欢做事井井有条，会努力维持结构和解决模棱两可的问题。他们有挑剔的倾向，尤其是对家庭环境。在工作中，ENFJ 在与人打交道的岗位上表现出色。他们天生就是社交委员会的一员。他们善于理解他人，并能说出让人高兴的话，这使他们成为咨询顾问的天生人选。他们喜欢成为众人瞩目的焦点，在可以激励和领导他人的场合（如教学），他们的表现非常出色。ENFJ 不喜欢与非个人的推理打交道。他们不理解也不欣赏推理的优点，在被迫处理逻辑和事实而与人无关的情况下，他们会感到不开心。生活在充满可能性的世界里，他们喜欢自己的计划多于成就。他们对未来的可能性感到兴奋，但对现在却很容易感到厌倦和不安。ENFJ 有一种特殊的与人相处的天赋，当他们能利用这种天赋帮助他人时，他们基本上是快乐的。他们从服务他人中获得最大的满足感。他们对人类怀有真正的兴趣，对人有非凡的直觉，这使他们能够吸引最拘谨的人。ENFJ 强烈需要亲密无间的人际关系，他们会付出很多努力来建立和维护这些关系。一旦进入一段关系，他们就会非常忠诚和值得信赖。没有发展出感受力的 ENFJ 可能很难做出正确的决定，在决策过程中可能会严重依赖他人。如果没有发展直觉，他们可能无法看到各种可能性，会根据既定的价值体系或社会规则过快地判断事物，而没有真正了解当前的情况。还没有在世界上找到自己位置的 ENFJ 很可能对批评极为敏感，并有过度担忧和内疚的倾向。他们还很可能会操纵和控制他人。总的来说，ENFJ 是迷人、热情、亲切、富有创造力和多样化的人，他们对他人的特点有着丰富的洞察力。这种洞察他人成长潜力的特殊能力，加上助人为乐的真诚动力，使 ENFJ 成为真正有价值的人。虽然 ENFJ 人乐于助人、富有爱心，但他们需要记住，在重视自己需求的同时，也要重视他人的需求。",
    "jungianFunctionalPreference": {
      "dominant": "外向情感",
      "auxiliary": "内向的直觉",
      "tertiary": "外向感知",
      "inferior": "内向型思维"
    },
    "generalTraits": [
      "真诚热情地关心他人",
      "重视人们的感受",
      "价值结构和组织",
      "重视和谐，善于创造和谐",
      "出色的人际交往能力",
      "不喜欢非个人化的逻辑和分析",
      "强大的组织能力",
      "忠诚和诚实",
      "富有创造力和想象力",
      "享受多样性和新挑战",
      "从帮助他人中获得个人满足感",
      "对批评和不和极为敏感",
      "需要他人的认可才能自我感觉良好"
    ],
    "relationshipStrengths": [
      "良好的语言沟通能力",
      "对人们的想法和动机非常敏锐",
      "激励、鼓舞人心；激发他人的最佳状态",
      "热情洋溢的亲切和肯定",
      "有趣的人--活泼幽默、富有戏剧性、精力充沛、乐观向上",
      "良好的理财技巧",
      "恋爱失败后能够 \"继续前进\"（尽管他们会自责）",
      "忠诚和承诺--他们希望建立终身关系",
      "努力实现 \"双赢\"",
      "满足他人需求的动力"
    ],
    "relationshipWeaknesses": [
      "有窒息和过度保护的倾向",
      "控制和/或操纵倾向",
      "对自身需求关注不够",
      "倾向于批评与自己不一致的观点和态度",
      "有时不了解社交礼仪或礼节",
      "对冲突极为敏感，倾向于把事情掩盖起来作为一种回避策略",
      "当事情出错时，倾向于责备自己，而当事情做对时，却不给自己加分",
      "鲜明的价值体系使他们在某些领域不屈不挠",
      "他们可能太适应社会所接受或期望的东西，以至于无法评估超出其社交圈期望的东西是 \"对 \"还是 \"错\"。"
    ],
    "successDefinition": "ENFJ的动机来自外部环境，主要是他人；他人的才能、需求、愿望和关心构成了ENFJ生活的世界。当他们能够为他人 \"拨乱反正 \"时，他们就会茁壮成长；当他们通过重视他人的长处和能力来帮助同事、朋友和家人时，他们就会茁壮成长。ENFJ具有直觉能力，能根据受他人影响的方式调整自己的感受，因此，ENFJ具有一种积极的驱动力，能够找到合作的途径，为所有人带来尽可能好的结果。对 ENFJ 来说，成功来自于参与到为他人实现目标的过程中；来自于那些他们帮助过的人所取得的成就和满足感，这些成就和满足感丰富了人类世界的价值；来自于他们发现自己为他人所做的努力也成就了自己的人生。",
    "strengths": [
      "让他人感受到自己的价值和重要性",
      "快速洞察人的正反两面",
      "清楚地表达自己的感受",
      "为合作伙伴、家人和工作伙伴提供忠诚和承诺",
      "努力找到适合所有人的解决方案",
      "鼓励他人的幽默和自我表达",
      "想方设法帮助他人满足需求",
      "肯定积极的社区价值观",
      "自然而然地在社区中担任领导职务"
    ],
    "gifts": [
      "理解和体谅他人的感受；意识到 \"他们从哪里来\"。",
      "具有创造性表达的天赋，能将平凡的事物和环境转化为神奇的事物。",
      "增强与周围世界的联系，提高对周围世界的敏感度。",
      "能够看到问题的多个方面，以及解决问题的多种最佳途径。",
      "能够创造性地利用独处的宝贵时间。",
      "对万物之间的精神联系持开放态度",
      "他们变得越来越有创造力、远见卓识和同理心，从而成为企业、人员和生活中各种情况的有效和善良的管理者。"
    ],
    "potentialProblemAreas": [
      "任何天赋的力量，都有与之相关的弱点。没有 \"坏\"，就没有 \"好\"。没有 \"难\"，就没有 \"易\"。我们珍视自己的长处，却常常诅咒和忽视自己的短处。要想成长为一个人，并从生活中获得我们想要的东西，我们不仅要充分利用自己的长处，还要正视自己的短处并加以解决。这意味着我们要认真审视自己性格类型中潜在的问题所在。在 ENFJ 身上发现的大多数较弱特征都是由于他们主导的 \"外向情感 \"过于看重外部世界的客观价值，从而过多地根据他人的需求或外表来判断。这主要是由于 ENFJ 还没有完全适应他们的内向直觉功能，以至于他们无法分辨出他们可能在哪些方面忽略了自己内心的潜在需求，并被这些表象所误导。ENFJ会自然而然地向外寻找价值和满足感，虽然这个方向对于满足他们对关系和舒适感的主要需求至关重要，但如果没有直觉功能的支持性平衡，ENFJ可能会过度重视外部世界，以至于忽略了自己，对人和世界的判断变得固定不变。在这种情况下，ENFJ 会倾向于生活在一个僵化的--在别人看来有点超现实的--有明确价值观的世界里，而这个世界往往显得 \"夸大其词\"，或执着地与其他人或人的情况联系在一起。"
    ],
    "explanationOfProblems": "上述大多数问题都可以看作是外向思维功能在人格中占据主导地位的直接结果。在大多数情况下，情况正是如此，但我们也应该认识到，在其他类型的人看来，ENTJ 性格中的某些弱点更为明显，这与其说是因为ENTJ 的主导功能过强，不如说是因为他们的感觉功能天生低劣且缺乏适应性。我们还必须认识到，所有功能在所有人身上的表现程度都是不同的，这里讨论的一些问题只适用于表现强烈的 ENTJ，在这种情况下，完全使用外向思维来指导生活的态度会产生自己的特殊问题。外向型思维的过度主导导致了他们看待世界的极端理智的方式，在这种方式下，诸如对与错、好与坏、有用与无用等价值观，只能根据它们是否适用于一种近乎数学上精确的--对 ENTJ 来说--总是理性的--生活态度来判断。没有其他观察或判断方式提供的平衡，ENTJ 无法解释基于他人内心观点或感觉行为的行动，因此这些事情总是被负面地评判，要么是无关紧要，要么充其量是影响不大。此外，由于他们的思维态度总是向外，完全受制于感官之外的世界，如果没有一些内心感受到的客观性的平衡，ENTJ 经常会追随自己的想法和野心，而不考虑自己的身体和情感需求。事实上，ENTJ 经常觉得，只要他的项目、工作、外部现实与他的理性观点一致，那么他的世界就会一切顺利，他的所有需求都会得到满足。不幸的是，这种态度永远不会得到满足，因为这个世界不仅是理性的，而且还充满了各种情况和人类行为，而这些情况和人类行为必须以截然不同的标准来欣赏和理解，而且--对于 ENTJ 来说--往往又是看似荒谬的标准。健康的人格需要在主导功能和辅助功能之间取得良好的平衡。对于 ENTJ 来说，主导功能 \"外向思维 \"需要得到辅助功能 \"内向直觉 \"的支持。如果内向直觉的存在仅仅是为了支持外向思维所创造的智力原理，那么这两种功能都没有得到充分发挥。内向直觉是 ENTJ 通往内心世界的通道，是能够告诉他们世界是如何影响他们的信息。因为它是内向的，所以它的图像来自心灵的主观深处，包含了所有 ENTJ 在严格的理性和客观世界观中没有考虑到的东西。内向直觉为 ENTJ 提供了他们所需的带有个人偏见的信息，以平衡他们的世界观，保护他们不被无私而又一意孤行的事实、数字和他们仅从外部世界接受的理论所完全吞噬。由于这些内在信息往往与 ENTJ 坚守的观念相反，因此常常会被拒绝，或者即使被接受，也会转而对外部环境或他人的行为做出负面判断，而不是被视为对 ENTJ 自身态度和行为的一种纠正平衡。",
    "solutions": "要想成长为一个人，ENTJ 需要认识到直觉在他们生活中扮演的角色，并学会理解直觉的语言。特别是，ENTJ 需要认识到，他们的直觉功能并不是指向外部世界的，它的图像是个人的、主观的，与ENTJ 的内在自我受外部世界和自身行为影响的方式直接相关。内向直觉并不是一个显而易见的过程，它与 ENTJ 所习惯的理性、直接的思维方式截然不同。尽管如此，如果能够理解并充分利用直觉来支持思考，它就能使 ENTJ 成为所有性格类型中最外向、最有成效的人。因此，必须让这种天赋发挥其最大作用，而不是限制它的才能，只让它在似乎与 ENTJ 的外向型思维一致时才说话。以下是一些帮助你运用内向直觉的具体建议。当遇到需要做出重要决定的情况时，尽量推迟足够长的时间，以便能够静静地坐下来思考。在这样做的过程中，让自己去感受和观察脑海中出现的与这种情况有关的画面。试着把那些立即出现的、作为你自己的信念和思维产物的画面放在一边，仔细观察其他画面。如果这些图像和想法是你非常信任的人的观点，那么试着在脑海中质疑他们，找出他们这样考虑问题的原因。在你周围，有些人似乎总是知道该往哪个方向走，或者事情是如何运作的，或者某种情况的结果会是怎样，而他们似乎并没有掌握足够的信息来做到这一点。这些人是直觉型的，他们的世界充满了各种可能性，他们能立刻意识到这些可能性适合某些情况。你也有这种天赋，但你习惯于不遵循这种天赋，而是喜欢思考，找出 \"应该 \"正确的选择。我在这里把 \"应该 \"放在引号里是有很好的理由的，因为你自己也知道，事情往往是朝着你预感到的方向发展的，但你却不假思索地拒绝接受。试着让这些直观的印象发挥其作用，并认识到它们是真正的可能性，应该对其进行更仔细的研究。要知道，它们并不是毫无根据的形象和想法，而是依赖于有效的信息来源，而你只是习惯性地把它们从你的生活中屏蔽掉了。",
    "livingHappilyTips": "有些 ENTJ 很难融入我们的社会。他们的问题通常与强烈的教条主义和过于理性的生活态度有关，同时几乎完全缺乏理解他人需求的能力。在出现这种强烈的表达困难时，ENTJ 会发现自己不断受到这个世界的困扰，因为这个世界拒绝与他们的理想保持一致，并制造出让 ENTJ 感到力不从心的局面。在这种情况下，ENTJ 往往会表现出孩子气的情绪化，以至于他人对其产生反感，并在情感上孤立了ENTJ。这样的 ENTJ 经常会发现自己没有朋友，生意伙伴或员工也不愿意与 ENTJ 讨论任何与任务无关的问题。他人的这种行为只会激发 ENTJ 的潜在情绪，而这种情绪会通过他们不适应的直觉功能，向他们揭示他人的阴谋、下流和隐蔽的阻挠行为。毋庸置疑，这种猜疑和幼稚的情绪，再加上教条式的要求，以符合 ENTJ 自己看待世界的方式，很快就会破坏家庭和亲密关系。ENTJ 有责任打破这种行为的怪圈，让他们的内向直觉在生活中占有一席之地。通过对这一功能的关注，ENTJ 可以发现一条道路，了解并认识到自己的行为不仅会对他人造成影响，也会给自己带来更大的可能性，不仅能与他人建立和谐的关系，也能让自己更清楚什么才是对自己最好的。对于 ENTJ 来说，理解他人的感觉需求和判断并不是一件容易的事，但通过直觉功能，他们可以找到一些图像和想法，这些图像和想法虽然不能直接针对他人的感觉判断，但却可以让他们跳出严格意义上的理性世界观，从而认识到确实存在一个必须考虑的不同视角。",
    "tenRulesToLive": [
      "发挥你的优势！给自己每一个机会，向他人展示你对某种情况的欣赏，以及你如何将它变成一个好结果。在你能做到的地方负责起来。",
      "面对自己的弱点！了解自己也有极限。你小心翼翼的世界观并不是全部。事物的外观和感觉可能与你无关，但却与许多人有关。试着允许这样的事情发生，并从中学习。",
      "谈话时间，了解他人的真实想法。在与他人交谈时，你需要超越自己的想法，让他们对某种情况的理解更深入地触及你的内心。这样，你就有可能把他们的需求作为现实世界的目标加以考虑，如果把这些目标纳入你的想法中，就会给生活和人际关系带来更大的和谐与质量。",
      "抽出时间，让整个情境与你对话。不要否定那些来自他人或自己内心的抽象、看似难以理解或令人烦恼的审美和感觉判断。暂时放下一切，停止思考和担忧，放松地去面对这些想法，让它们与你对话。也许它们是可以被容纳的，也许其中隐藏的东西提供了一种新的方式",
      "当你心烦意乱时，你就输了。你的能量和理性认识是强大的资产，但如果它们与你背道而驰，让你只剩下无法处理的情绪，那就会非常有害。请记住，我们不能总是指望别人会接受你的看法，当你想让他们接受你的看法的努力失败时，你就会产生怨恨甚至被抛弃的感觉。你不能这样与世界打交道。节制自己的想法，允许他人有自己的空间，你就会成长。",
      "尊重你对智力兼容性的需求。不要期望自己是一个 \"温柔的 \"或 \"温暖的 \"人。要认识到，你与他人最热烈的联系将始于头脑，而非心灵。意识到他人的情感需求，用对你来说真实的语言表达你对他们真诚的爱和尊重。做你自己。",
      "对自己负责。不要把生活中的问题归咎于他人。向内寻找解决方案。没有人比你更能掌控自己的生活。",
      "谦虚。评判自己至少要像评判他人一样严厉。",
      "以积极的态度对待人与人之间的差异。不要因为纠结于他人的局限性而困扰自己和他人。他们需要你的指导，你也需要他们把事情看透。试着认识到，在你自己能力范围之外的某些领域，谁的表现最出色。让他人的感受成为你的力量而不是阻碍。"
    ]
  },
  {
    type: "ENTJ",
    "name": "外向 直觉 思维 判断",
    "nameDescription": "外向思维与内向直觉",
    "epithet": "执行者",
    "description": "作为一名 ENTJ，你的主要生活模式是对外的，你会理性、逻辑地处理事情。你的次要模式是内在模式，主要通过直觉来接受事物。ENTJ 是天生的领导者。他们生活在一个充满可能性的世界里，在这个世界里，他们看到了各种有待克服的挑战，他们希望成为克服这些挑战的人。他们具有领导力，这得益于他们对复杂事物的迅速把握、吸收大量非个人化信息的能力以及快速果断的判断力。他们是 \"负责任 \"的人。ENTJ 非常注重事业，能很自然地融入企业世界。他们不断扫描周围环境，寻找潜在的问题，并将其转化为解决方案。他们通常从长远的角度看问题，通常能成功地找出解决问题的计划，尤其是企业性质的问题。ENTJ 通常能在商界取得成功，因为他们对领导力有着强烈的追求。他们在工作中不知疲倦地努力，并能预见组织的发展方向。因此，他们是天生的企业领导者。在 ENTJ 的世界里，容不得半点差错。他们不喜欢看到错误重复发生，对低效率没有耐心。当他们的耐心在这些方面受到考验时，他们可能会变得相当苛刻，因为他们天生不懂别人的感受，更可能不认为自己的判断应该考虑别人的感受。像许多类型的人一样，ENTJ 也很难跳出自己的视角看问题。与其他类型的人不同，耳鼻喉科医生天生对那些与自己看法不同的人缺乏耐心。ENTJ 需要有意识地认识到他人意见的价值，以及对他人的感受保持敏感的价值。如果缺乏这种意识，那么 ENTJ 就会成为一个强势、恫吓和盛气凌人的人。这对 ENTJ 来说可能是一个真正的问题，因为他们可能会被剥夺重要的信息和来自他人的合作。在他们的个人世界中，这可能会使一些 ENTJ 人成为盛气凌人的配偶或父母。ENTJ 具有巨大的个人力量和存在感，这将成为他们实现目标的动力。然而，这种个人力量也是疏远和自我膨胀的媒介，ENTJ 最好避免这种情况。耳鼻喉科医生是非常强势、果断的人。他们能迅速做出决定，并能迅速向其他人表达自己的观点和决定。没有发展出直觉的 ENTJ 会在不了解所有问题和可能的解决方案的情况下匆忙做出决定。另一方面，没有发展出思考力的 ENTJ 会很难将逻辑应用到他们的洞察力中，因此经常会做出错误的决定。在这种情况下，他们可能会有杰出的想法和对情况的洞察力，但他们可能不善于根据自己的理解来决定如何行动，或者他们的行动可能会前后矛盾。如果 ENTJ 的发展方式总体上不太理想，他们可能会变得独断专行、粗鲁无礼--在没有充分理由的情况下，不顾他人的感受，擅自下达命令和指示。虽然 ENTJ 天生不懂别人的感受，但这些人经常会有非常强烈的情感倾向。通常，这些情感对 ENTJ 来说是非常强烈的，尽管他们很可能会将其隐藏起来，不为常人所知，认为这种情感是一种弱点。由于情感和价值观的世界不是 ENTJ 天生就能发挥作用的地方，他们有时可能会做出价值判断，并沉浸在毫无根据和不恰当的情感中，这会给他们带来问题--有时是相当严重的问题。ENTJ 喜欢与人交往。作为外向者，他们主要从外部获得能量和刺激。对于 ENTJ 来说，没有什么比进行一场生动而富有挑战性的谈话更令人愉快和满足的了。他们尤其尊重那些能够站在 ENTJ 面前，为自己的观点据理力争的人。不过，这样做的人并不多，因为 ENTJ 是一种非常强势、充满活力的存在，他们拥有极强的自信心和出色的语言沟通能力。即使是最自信的人，在与 ENTJ 辩论时也会有自我怀疑的时候。ENTJ 希望自己的家美观大方、家具齐全、运行高效。他们可能会非常重视子女的良好教育和培养，渴望与配偶建立融洽而忠实的关系。在家里，耳鼻喉科医生和在事业上一样需要当家作主。ENTJ 最适合与自我形象鲜明、善于思考的人配对。由于 ENTJ 人的主要精力都放在事业上，因此有些 ENTJ 人对经常不在家感到困扰，无论是身体上还是精神上。如果他们不忘在生活中保持平衡，那么 ENTJ 有很多天赋，这使他们有可能拥有很大的个人能力。他们是自信、创新、长远的思考者，具有将理论和可能性转化为坚实的行动计划的卓越能力。他们通常是极具影响力的人物，拥有完成任何既定目标的工具。",
    "jungianFunctionalPreference": {
      "auxiliary": "内向的直觉",
      "dominant": "外向型思维",
      "inferior": "内向的感觉",
      "tertiary": "外向感知"
    },
    "generalTraits": [
      "将理论转化为计划的动力",
      "高度重视知识",
      "面向未来",
      "自然领导",
      "对低效和无能不耐烦",
      "希望一切井然有序",
      "出色的语言沟通能力",
      "不喜欢例行公事、注重细节的工作",
      "自信",
      "果断"
    ],
    "relationshipStrengths": [
      "对人们的想法和思想真正感兴趣",
      "充满热情和活力",
      "认真履行承诺",
      "有正义感，热衷于做正确的事",
      "非常善于理财",
      "极其直接了当",
      "口语流利",
      "在生活的各个方面增进并鼓励知识和自我成长",
      "能够义无反顾地离开人际关系",
      "能够将冲突局势转化为积极的经验教训",
      "能够很好地接受建设性批评",
      "极高的标准和期望（既是优点也是缺点）",
      "通常有强烈的情感和多愁善感的倾向",
      "能够进行纪律处分"
    ],
    "relationshipWeaknesses": [
      "他们对口头辩论的热情会让他们显得好辩",
      "倾向于挑战和对抗",
      "倾向于参与 \"双输 \"对话",
      "倾向于难以倾听他人",
      "倾向于批评与自己不一致的观点和态度",
      "极高的标准和期望（既是优点也是缺点）",
      "不能自然地与人的感受和反应保持一致",
      "可能难以表达爱和情感，有时显得笨拙或不恰当",
      "可能对他人具有压倒性的威慑力",
      "倾向于总是自己说了算，而不是分担责任",
      "可能非常苛刻，不能容忍混乱或低效",
      "控制倾向",
      "可能不善于给予赞美或意识到他人需要赞美",
      "如果不快乐或发展不足，他们可能会非常不近人情、独断专行或粗声粗气",
      "容易做出草率决定",
      "在极度紧张时脾气暴躁"
    ],
    "successDefinition": "从最基本的意义上讲，ENTJ 是现实主义者。这不仅是因为他们的思维建立在对周围世界实际情况的清晰认识之上，还因为他们的想法和策略是围绕着那些明确、\"脚踏实地\"、常识性的信念来构建的，这些信念概括了生活中显而易见且不可否认的事实。不过，虽然 ENTJ 可能会对眼前的状况持务实态度，但在它能变得更有成效、更有用或更有价值之前，他们几乎不会对它感到满意。在这些问题上，ENTJ 的推理总是很清晰，而且一般不带感情色彩。如果行动可以改善一件事或一种情况，那么就应该去做，而 ENTJ 总是在这种行动中，组织、规划和领导前进的道路，直到实现最好的结果。这就使 ENTJ 的成功变得清晰可见，成为现实世界中可以衡量的结果。无论是用金钱、砖块、面包，还是用快乐的人们来衡量，成功的 ENTJ 都知道这些结果都归功于他们的信念，那就是努力使每种情况都达到最佳效果，让大多数人都能从中获得最大的收益。",
    "strengths": [
      "在任何情况下都能直奔主题，不被非必要问题所困扰。",
      "他们有能力控制和管理实时/现实情况，因而自然而然地具有领导力。",
      "不带偏见或感情色彩的事实分析才能。",
      "对生活采取 \"能做 \"的态度，使工作环境对他们来说是一个积极的地方。",
      "非常重视积极的社会和经济制度、结构和政府。",
      "时间和空间管理能力首屈一指，一切都井井有条，各就各位。",
      "能够不断综合新思想和新概念，并将其转化为商业、社会、金融或环境发展战略。"
    ],
    "gifts": [
      "通过解决社会公正问题创造巨大效益的才能。",
      "能够认识到自己的潜能，并根据他人的期望进行调解。",
      "对生活的态度，包括认识到自己的需求与他人的需求之间的差异。",
      "懂得适时停下脚步，审视生活，认识到当下的特质。",
      "具有向他人展示如何克服外在生活困难的才能",
      "拓宽自己的抱负，让他人参与决策并从决策中获益，而不是将他人排除在外。"
    ],
    "potentialProblemAreas": [
      "可能无法理解他人与自己不同的需求。",
      "可能会不明智地认为自己的想法是唯一正确的想法，因此被其他人完全执行。",
      "当遇到需要感情判断的情况时，可能会变得孩子气地撒娇或发怒。",
      "可能沉迷于某个计划或野心，而忘记了个人和他人的需要。",
      "可能会把每一个不符合其理性信念的决定都视为个人的拒绝。",
      "容易被他人说服或操纵，认同他人的理性态度。",
      "可能沉迷于小障碍和小困难，以至于忘记了整体计划",
      "可能认为自然限制实际上是应该消除的疾病",
      "可能会认为别人一直在密谋反对他们。",
      "他们可能只相信自己对世界或某种情况的看法是正确的，甚至将其奉为一种教条，周围的人都必须遵循。"
    ],
    "explanationOfProblems": "上述大多数问题都可以看作是外向思维功能在人格中占据主导地位的直接结果。在大多数情况下，情况正是如此，但我们也应该认识到，在其他类型的人看来，ENTJ 性格中的某些弱点更为明显，这与其说是因为ENTJ 的主导功能过强，不如说是因为他们的感觉功能天生低劣且缺乏适应性。我们还必须认识到，所有功能在所有人身上的表现程度都是不同的，这里讨论的一些问题只适用于表现强烈的 ENTJ，在这种情况下，完全使用外向思维来指导生活的态度会产生自己的特殊问题。外向型思维的过度主导导致了他们看待世界的极端理智的方式，在这种方式下，诸如对与错、好与坏、有用与无用等价值观，只能根据它们是否适用于一种近乎数学上精确的--对 ENTJ 来说--总是理性的--生活态度来判断。没有其他观察或判断方式提供的平衡，ENTJ 无法解释基于他人内心观点或感觉行为的行动，因此这些事情总是被负面地评判，要么是无关紧要，要么充其量是影响不大。此外，由于他们的思维态度总是向外，完全受制于感官之外的世界，如果没有一些内心感受到的客观性的平衡，ENTJ 经常会追随自己的想法和野心，而不考虑自己的身体和情感需求。事实上，ENTJ 经常觉得，只要他的项目、工作、外部现实与他的理性观点一致，那么他的世界就会一切顺利，他的所有需求都会得到满足。不幸的是，这种态度永远不会得到满足，因为这个世界不仅是理性的，而且还充满了各种情况和人类行为，而这些情况和人类行为必须以截然不同的标准来欣赏和理解，而且--对于 ENTJ 来说--往往又是看似荒谬的标准。健康的人格需要在主导功能和辅助功能之间取得良好的平衡。对于 ENTJ 来说，主导功能 \"外向思维 \"需要得到辅助功能 \"内向直觉 \"的支持。如果内向直觉的存在仅仅是为了支持外向思维所创造的智力原理，那么这两种功能都没有得到充分发挥。内向直觉是 ENTJ 通往内心世界的通道，是能够告诉他们世界是如何影响他们的信息。因为它是内向的，所以它的图像来自心灵的主观深处，包含了所有 ENTJ 在严格的理性和客观世界观中没有考虑到的东西。内向直觉为 ENTJ 提供了他们所需的带有个人偏见的信息，以平衡他们的世界观，保护他们不被无私而又一意孤行的事实、数字和他们仅从外部世界接受的理论所完全吞噬。由于这些内在信息往往与 ENTJ 坚守的观念相反，因此常常会被拒绝，或者即使被接受，也会转而对外部环境或他人的行为做出负面判断，而不是被视为对 ENTJ 自身态度和行为的一种纠正平衡。",
    "solutions": "要想成长为一个人，ENTJ 需要认识到直觉在他们生活中扮演的角色，并学会理解直觉的语言。特别是，ENTJ 需要认识到，他们的直觉功能并不是指向外部世界的，它的图像是个人的、主观的，与ENTJ 的内在自我受外部世界和自身行为影响的方式直接相关。内向直觉并不是一个显而易见的过程，它与 ENTJ 所习惯的理性、直接的思维方式截然不同。尽管如此，如果能够理解并充分利用直觉来支持思考，它就能使 ENTJ 成为所有性格类型中最外向、最有成效的人。因此，必须让这种天赋发挥其最大作用，而不是限制它的才能，只让它在似乎与 ENTJ 的外向型思维一致时才说话。以下是一些帮助你运用内向直觉的具体建议。当遇到需要做出重要决定的情况时，尽量推迟足够长的时间，以便能够静静地坐下来思考。在这样做的过程中，让自己去感受和观察脑海中出现的与这种情况有关的画面。试着把那些立即出现的、作为你自己的信念和思维产物的画面放在一边，仔细观察其他画面。如果这些图像和想法是你非常信任的人的观点，那么试着在脑海中质疑他们，找出他们这样考虑问题的原因。在你周围，有些人似乎总是知道该往哪个方向走，或者事情是如何运作的，或者某种情况的结果会是怎样，而他们似乎并没有掌握足够的信息来做到这一点。这些人是直觉型的，他们的世界充满了各种可能性，他们能立刻意识到这些可能性适合某些情况。你也有这种天赋，但你习惯于不遵循这种天赋，而是喜欢思考，找出 \"应该 \"正确的选择。我在这里把 \"应该 \"放在引号里是有很好的理由的，因为你自己也知道，事情往往是朝着你预感到的方向发展的，但你却不假思索地拒绝接受。试着让这些直观的印象发挥其作用，并认识到它们是真正的可能性，应该对其进行更仔细的研究。要知道，它们并不是毫无根据的形象和想法，而是依赖于有效的信息来源，而你只是习惯性地把它们从你的生活中屏蔽掉了。",
    "livingHappilyTips": "有些 ENTJ 很难融入我们的社会。他们的问题通常与强烈的教条主义和过于理性的生活态度有关，同时几乎完全缺乏理解他人需求的能力。在出现这种强烈的表达困难时，ENTJ 会发现自己不断受到这个世界的困扰，因为这个世界拒绝与他们的理想保持一致，并制造出让 ENTJ 感到力不从心的局面。在这种情况下，ENTJ 往往会表现出孩子气的情绪化，以至于他人对其产生反感，并在情感上孤立了ENTJ。这样的 ENTJ 经常会发现自己没有朋友，生意伙伴或员工也不愿意与 ENTJ 讨论任何与任务无关的问题。他人的这种行为只会激发 ENTJ 的潜在情绪，而这种情绪会通过他们不适应的直觉功能，向他们揭示他人的阴谋、下流和隐蔽的阻挠行为。毋庸置疑，这种猜疑和幼稚的情绪，再加上教条式的要求，以符合 ENTJ 自己看待世界的方式，很快就会破坏家庭和亲密关系。ENTJ 有责任打破这种行为的怪圈，让他们的内向直觉在生活中占有一席之地。通过对这一功能的关注，ENTJ 可以发现一条道路，了解并认识到自己的行为不仅会对他人造成影响，也会给自己带来更大的可能性，不仅能与他人建立和谐的关系，也能让自己更清楚什么才是对自己最好的。对于 ENTJ 来说，理解他人的感觉需求和判断并不是一件容易的事，但通过直觉功能，他们可以找到一些图像和想法，这些图像和想法虽然不能直接针对他人的感觉判断，但却可以让他们跳出严格意义上的理性世界观，从而认识到确实存在一个必须考虑的不同视角。",
    "tenRulesToLive": [
      "发挥你的优势！给自己每一个机会，向他人展示你对某种情况的欣赏，以及你如何将它变成一个好结果。在你能做到的地方负责起来。",
      "面对自己的弱点！了解自己也有极限。你小心翼翼的世界观并不是全部。事物的外观和感觉可能与你无关，但却与许多人有关。试着允许这样的事情发生，并从中学习。",
      "谈话时间，了解他人的真实想法。在与他人交谈时，你需要超越自己的想法，让他们对某种情况的理解更深入地触及你的内心。这样，你就有可能把他们的需求作为现实世界的目标加以考虑，如果把这些目标纳入你的想法中，就会给生活和人际关系带来更大的和谐与质量。",
      "抽出时间，让整个情境与你对话。不要否定那些来自他人或自己内心的抽象、看似难以理解或令人烦恼的审美和感觉判断。暂时放下一切，停止思考和担忧，放松地去面对这些想法，让它们与你对话。也许它们是可以被容纳的，也许其中隐藏的东西提供了一种新的方式",
      "当你心烦意乱时，你就输了。你的能量和理性认识是强大的资产，但如果它们与你背道而驰，让你只剩下无法处理的情绪，那就会非常有害。请记住，我们不能总是指望别人会接受你的看法，当你想让他们接受你的看法的努力失败时，你就会产生怨恨甚至被抛弃的感觉。你不能这样与世界打交道。节制自己的想法，允许他人有自己的空间，你就会成长。",
      "尊重你对智力兼容性的需求。不要期望自己是一个 \"温柔的 \"或 \"温暖的 \"人。要认识到，你与他人最热烈的联系将始于头脑，而非心灵。意识到他人的情感需求，用对你来说真实的语言表达你对他们真诚的爱和尊重。做你自己。",
      "对自己负责。不要把生活中的问题归咎于他人。向内寻找解决方案。没有人比你更能掌控自己的生活。",
      "谦虚。评判自己至少要像评判他人一样严厉。",
      "以积极的态度对待人与人之间的差异。不要因为纠结于他人的局限性而困扰自己和他人。他们需要你的指导，你也需要他们把事情看透。试着认识到，在你自己能力范围之外的某些领域，谁的表现最出色。让他人的感受成为你的力量而不是阻碍。",
      "不要迷恋！认识到个人世界对你、你的朋友、你的家人、你内心的自我价值感和生活的价值。以做一个好人为荣，不要让外部环境控制你。试着放松，让此刻属于你能在他人和自己身上发现的最美好的事物。没有什么比你自己的幸福更重要了"
    ]
  },
  {
    type: "INFP",
    "name": "内向 直觉 感觉 知觉",
    "nameDescription": "内向的直觉与外向的感觉",
    "epithet": "调停者",
    "description": "作为一名 INFP，你的主要生活模式是内向的，主要通过直觉来接受事物。你的次要模式是外在的，你会根据自己对事物的感觉或它们与你个人价值体系的契合程度来处理事情。INFP 是理想主义者，他们生活在一个充满可能性的世界里。他们的生活受到强烈价值观的指导，这些价值观通常是他们自己的价值观，而不是传统或社会的价值观。INFP 非常忠诚于他们所信仰的事物和他们所爱的人。他们渴望和谐与真诚，非常重视个人的成长和自我实现。INFP 是富有创造力和想象力的人，他们通常对艺术、文学、音乐和哲学有浓厚的兴趣。他们善于理解他人的感受和动机，具有强烈的同理心。INFP 通常是安静、 introspective 的人，他们需要独处的时间来反思和充电。他们对自己和他人都有很高的期望，有时可能会显得过于理想化或不切实际。INFP 倾向于关注未来的可能性，而不是当前的现实。他们可能会花费大量时间思考人生的意义和目的，以及如何使世界变得更美好。在人际关系中，INFP 是忠诚、支持和理解的伙伴。他们非常重视情感连接和深度交流，不喜欢表面化的关系。INFP 可能会在决策过程中挣扎，因为他们往往会考虑多种可能性和价值观，很难做出最终决定。INFP 最适合在能够表达自己创造力和价值观的环境中工作，如艺术、教育、咨询或社会服务领域。他们不喜欢严格的结构和规则， prefer 灵活和自主的工作环境。",
    "jungianFunctionalPreference": {
      "dominant": "内向直觉",
      "auxiliary": "外向情感",
      "tertiary": "内向思维",
      "inferior": "外向感知"
    },
    "generalTraits": [
      "理想主义和价值观驱动",
      "富有创造力和想象力",
      "强烈的同理心和理解力",
      "注重个人成长和自我实现",
      "安静、 introspective",
      "忠诚于信仰和所爱的人",
      "重视和谐与真诚",
      "关注未来的可能性",
      "善于理解他人的感受和动机",
      "可能显得过于理想化或不切实际"
    ],
    "relationshipStrengths": [
      "忠诚、支持和理解",
      "善于倾听和共情",
      "重视情感连接和深度交流",
      "富有创造力和想象力",
      "能够看到他人的潜力",
      "愿意为他人的成长和幸福付出努力",
      "具有强烈的道德感和正义感",
      "能够提供情感支持和安慰"
    ],
    "relationshipWeaknesses": [
      "可能过于理想化或不切实际",
      "在决策过程中可能犹豫不决",
      "对批评和冲突敏感",
      "可能避免面对现实问题",
      "有时会过度自我批判",
      "可能难以设定边界",
      "在压力下可能变得情绪波动"
    ],
    "successDefinition": "对 INFP 来说，成功不仅仅是外在的成就，更是内在的满足感和自我实现。他们认为成功是能够按照自己的价值观生活，追求自己的理想，并为世界做出积极的贡献。INFP 重视个人成长和自我完善，他们认为成功是不断学习和发展的过程。他们也重视与他人的深度连接和关系，认为成功是建立真诚、有意义的人际关系。",
    "strengths": [
      "富有创造力和想象力",
      "强烈的同理心和理解力",
      "理想主义和价值观驱动",
      "善于理解他人的感受和动机",
      "忠诚于信仰和所爱的人",
      "能够看到他人的潜力",
      "具有强烈的道德感和正义感"
    ],
    "gifts": [
      "创造性表达的能力",
      "理解和共情他人的能力",
      "看到可能性和潜力的能力",
      "为理想而奋斗的热情",
      "创造和谐与理解的能力"
    ],
    "potentialProblemAreas": [
      "可能过于理想化或不切实际",
      "在决策过程中可能犹豫不决",
      "对批评和冲突敏感",
      "可能避免面对现实问题",
      "有时会过度自我批判",
      "可能难以设定边界",
      "在压力下可能变得情绪波动"
    ],
    "explanationOfProblems": "INFP 的问题往往源于他们的理想主义和对完美的追求。他们可能会对自己和他人设定过高的标准，导致失望和挫折。INFP 对批评和冲突非常敏感，可能会避免面对现实问题或困难的对话。他们的决策过程可能会受到情感和价值观的影响，导致犹豫不决或难以做出实际的选择。此外，INFP 可能会过度关注未来的可能性，而忽视当前的现实，导致计划难以实现。",
    "solutions": "INFP 可以通过以下方式解决潜在问题：1. 设定现实的期望和目标，认识到完美是不可能的；2. 学习面对批评和冲突，将其视为成长的机会；3. 发展决策技能，平衡情感和理性；4. 关注当前的现实，同时保持对未来的愿景；5. 设定健康的边界，学会照顾自己的需求；6. 寻找支持和反馈，避免过度自我批判。",
    "livingHappilyTips": "INFP 可以通过以下方式过上更快乐的生活：1. 找到表达创造力和价值观的途径；2. 建立真诚、有意义的人际关系；3. 给自己足够的独处时间来反思和充电；4. 设定现实的目标和期望；5. 学会接受自己和他人的不完美；6. 寻找与自己价值观一致的工作和活动；7. 培养应对压力和挫折的能力；8. 保持对学习和成长的开放态度。",
    "tenRulesToLive": [
      "忠于自己的价值观和理想，但保持对新想法的开放态度。",
      "给自己足够的独处时间来反思和充电。",
      "建立真诚、有意义的人际关系，避免表面化的互动。",
      "设定现实的目标和期望，认识到完美是不可能的。",
      "学会面对批评和冲突，将其视为成长的机会。",
      "发展决策技能，平衡情感和理性。",
      "关注当前的现实，同时保持对未来的愿景。",
      "设定健康的边界，学会照顾自己的需求。",
      "寻找表达创造力和价值观的途径。",
      "保持对学习和成长的开放态度，不断探索新的可能性。"
    ]
  }
];